cfd/OpenFOAM/compressible/rhoSimpleFoam/05_Mapping/common/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}

// ************************************************************************* //

#include "include/boundaryConditions"

// ************************************************************************* //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $temperature;


boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    
    freestream
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    model
    {
        type            fixedValue;
        value           $internalField;
    }
    
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
