cfd/OpenFOAM/compressible/rhoSimpleFoam/05_Mapping/common/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

// ************************************************************************* //

ddtSchemes
{
    default         steadyState;
}


gradSchemes
{
    default         Gauss linear;

    limited         cellLimited Gauss linear 1;
    grad(U)         $limited;
    grad(k)         $limited;
    grad(omega)     $limited;
    grad(subsetU)   $limited;
}


divSchemes
{
    default         none;

    div(phi,U)      bounded Gauss linearUpwind limited;

    energy          bounded Gauss linearUpwind limited;
    div(phi,e)      $energy;
    div(phi,K)      $energy;
    div(phi,Ekp)    $energy;

    turbulence      bounded Gauss upwind;
    div(phi,k)      $turbulence;
    div(phi,omega)  $turbulence;

    div(phid,p)     Gauss upwind;
    div((phi|interpolate(rho)),p)  bounded Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U)))))    Gauss linear;
}


laplacianSchemes
{
    default         Gauss linear corrected;
}


interpolationSchemes
{
    default         linear;
}


snGradSchemes
{
    default         corrected;
}


wallDist
{
    method          meshWave;
}

// ************************************************************************* //
